- Built-in Method for Transformation
- Custom Function Transformation

In [ ]:
# memetakan nilai ke bentuk suatu nilai baru dengan bantuan suatu fungsi tertentu
f(x) -> y

In [30]:
import pandas as pd

matematika = pd.Series({'otong':80, 'dinda':90, 'mamat':100, 'eca':90})
fisika = pd.Series({'otong':90, 'dinda':70, 'mamat':100, 'eca':70})
biologi = pd.Series({'otong':100, 'dinda':60, 'mamat':100, 'eca':80})
df = pd.DataFrame({'matematika': matematika, 'fisika': fisika, 'biologi': biologi})

In [31]:
# method transformation in pandas, contohnya versi built-in method .head()
df.head()

       matematika  fisika  biologi
otong          80      90      100
dinda          90      70       60
mamat         100     100      100
eca            90      70       80

In [32]:
df.floordiv(10) # semua nilainya dibagi 10

       matematika  fisika  biologi
otong           8       9       10
dinda           9       7        6
mamat          10      10       10
eca             9       7        8

In [33]:
# mengetahui nilai rata-rata ujian untuk tiap siswa
df['rata2_ujian'] = df.mean(axis=1) # default axis=0, 0 for row sehingga menjadi 1 kolom kebawah, 1 for column sehingga menjadi 1 baris ke kanan.

In [34]:
df

       matematika  fisika  biologi  rata2_ujian
otong          80      90      100    90.000000
dinda          90      70       60    73.333333
mamat         100     100      100   100.000000
eca            90      70       80    80.000000

In [35]:
# Custom Function Transformation
def custom_function(x):
    rata2_custom = (x.matematika + 2*x.fisika + x.biologi)/4
    return rata2_custom

In [36]:
df['custom_rata2_ujian'] = df.apply(custom_function, axis=1) # dilakukan iterasi terhadap setiap data, bisa secara baris atau kolom

In [37]:
df

       matematika  fisika  biologi  rata2_ujian  custom_rata2_ujian
otong          80      90      100    90.000000                90.0
dinda          90      70       60    73.333333                72.5
mamat         100     100      100   100.000000               100.0
eca            90      70       80    80.000000                77.5